# Pandas 10 mins tutorial note
By Michael Wu

[Reference](https://pandas.pydata.org/pandas-docs/stable/10min.html)

Pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

## Import

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
import matplotlib.pyplot as plt

## Series

In [5]:
s = pd.Series([1,3,5,np.nan,6,8])

In [6]:
print(s)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [7]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

**Note that a series is like a n x 1 array (one column)**

## DataFrame
An array with index & labeled columns

In [8]:
dates = pd.date_range('20180101', periods=6)

In [9]:
dates

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

#### 1. By passing a NumPy array, an index and labeled columns:

In [10]:
df = pd.DataFrame(np.random.randn(6, 4), index = dates, columns = list('ABCD'))

In [11]:
df

                   A         B         C         D
2018-01-01 -0.403416 -0.272003  1.273209  0.932670
2018-01-02 -0.975630  1.165751  0.674616  0.210355
2018-01-03  1.224524 -0.990449  0.096453  1.030022
2018-01-04  1.931095  1.056339  1.868543  0.414657
2018-01-05  2.480872 -1.855205 -1.065594  1.320501
2018-01-06 -1.614513  0.254272  1.067823  0.599570

#### 2. By passing a dict of objects that can be converted to series-like:

In [12]:
df2 = pd.DataFrame({
    'A' : 1.,
    'B' : pd.Timestamp('20180101'),
    'C' : pd.Series(1, index = list(range(4)), dtype = 'float32'),
    'D' : np.array([3] * 4, dtype = 'int32'),
    'E' : pd.Categorical(["test", "train", "happy", "chill"]),
    'F' : 'foo'
})

In [13]:
df2

     A          B    C  D      E    F
0  1.0 2018-01-01  1.0  3   test  foo
1  1.0 2018-01-01  1.0  3  train  foo
2  1.0 2018-01-01  1.0  3  happy  foo
3  1.0 2018-01-01  1.0  3  chill  foo

**Check the data types of each column:**

In [14]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

**TAB completion for column names:**

df2.<TAB>

## Viewing Data

**View the top and bottom rows of df:**

In [15]:
df.head(2)

                   A         B         C         D
2018-01-01 -0.403416 -0.272003  1.273209  0.932670
2018-01-02 -0.975630  1.165751  0.674616  0.210355

In [16]:
df.tail(3)

                   A         B         C         D
2018-01-04  1.931095  1.056339  1.868543  0.414657
2018-01-05  2.480872 -1.855205 -1.065594  1.320501
2018-01-06 -1.614513  0.254272  1.067823  0.599570

**View the index, columns and underlying NumPy data values:**

In [17]:
df.index

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [19]:
df.values

array([[-0.40341622, -0.27200295,  1.27320946,  0.93267019],
       [-0.97563034,  1.16575089,  0.67461643,  0.21035489],
       [ 1.22452441, -0.99044876,  0.09645319,  1.03002194],
       [ 1.93109454,  1.05633898,  1.86854268,  0.41465706],
       [ 2.48087169, -1.85520491, -1.06559447,  1.32050052],
       [-1.61451252,  0.25427153,  1.06782343,  0.59956968]])

**Quick view of statistics:**

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.440489 -0.106883  0.652508  0.751296
std    1.669753  1.180483  1.029375  0.415582
min   -1.614513 -1.855205 -1.065594  0.210355
25%   -0.832577 -0.810837  0.240994  0.460885
50%    0.410554 -0.008866  0.871220  0.766120
75%    1.754452  0.855822  1.221863  1.005684
max    2.480872  1.165751  1.868543  1.320501

**Transpose:**

In [21]:
df.T

   2018-01-01  2018-01-02  2018-01-03  2018-01-04  2018-01-05  2018-01-06
A   -0.403416   -0.975630    1.224524    1.931095    2.480872   -1.614513
B   -0.272003    1.165751   -0.990449    1.056339   -1.855205    0.254272
C    1.273209    0.674616    0.096453    1.868543   -1.065594    1.067823
D    0.932670    0.210355    1.030022    0.414657    1.320501    0.599570

**Sorting by an axis (row):**

In [22]:
df.sort_index(axis = 1, ascending = False)

                   D         C         B         A
2018-01-01  0.932670  1.273209 -0.272003 -0.403416
2018-01-02  0.210355  0.674616  1.165751 -0.975630
2018-01-03  1.030022  0.096453 -0.990449  1.224524
2018-01-04  0.414657  1.868543  1.056339  1.931095
2018-01-05  1.320501 -1.065594 -1.855205  2.480872
2018-01-06  0.599570  1.067823  0.254272 -1.614513

**Sorting by values (of one particular column):**

In [23]:
df.sort_values(by = 'B')

                   A         B         C         D
2018-01-05  2.480872 -1.855205 -1.065594  1.320501
2018-01-03  1.224524 -0.990449  0.096453  1.030022
2018-01-01 -0.403416 -0.272003  1.273209  0.932670
2018-01-06 -1.614513  0.254272  1.067823  0.599570
2018-01-04  1.931095  1.056339  1.868543  0.414657
2018-01-02 -0.975630  1.165751  0.674616  0.210355

**Copy:**

In [24]:
df3 = df.copy()

**Add a new column:**

In [25]:
df3['E'] = ['one', 'two', 'three', 'four', 'five', 'six']

In [26]:
df3

                   A         B         C         D      E
2018-01-01 -0.403416 -0.272003  1.273209  0.932670    one
2018-01-02 -0.975630  1.165751  0.674616  0.210355    two
2018-01-03  1.224524 -0.990449  0.096453  1.030022  three
2018-01-04  1.931095  1.056339  1.868543  0.414657   four
2018-01-05  2.480872 -1.855205 -1.065594  1.320501   five
2018-01-06 -1.614513  0.254272  1.067823  0.599570    six

## Selection

### NOTICE: the index
`3:5` actually means the index '3 ~ 4'

In [27]:
df.iloc[3:5, 0:2]

                   A         B
2018-01-04  1.931095  1.056339
2018-01-05  2.480872 -1.855205

### Boolean Indexing

In [28]:
df[df.A > 0]

                   A         B         C         D
2018-01-03  1.224524 -0.990449  0.096453  1.030022
2018-01-04  1.931095  1.056339  1.868543  0.414657
2018-01-05  2.480872 -1.855205 -1.065594  1.320501

In [29]:
df[df > 0]

                   A         B         C         D
2018-01-01       NaN       NaN  1.273209  0.932670
2018-01-02       NaN  1.165751  0.674616  0.210355
2018-01-03  1.224524       NaN  0.096453  1.030022
2018-01-04  1.931095  1.056339  1.868543  0.414657
2018-01-05  2.480872       NaN       NaN  1.320501
2018-01-06       NaN  0.254272  1.067823  0.599570

## Some contents of "Selection" are skipped.
## For more please check out the official tutorial:

https://pandas.pydata.org/pandas-docs/stable/10min.html

## Operations

**Statistics:**

In [30]:
df.mean()

A    0.440489
B   -0.106883
C    0.652508
D    0.751296
dtype: float64

In [36]:
df.mean(axis = 'index')

A    0.440489
B   -0.106883
C    0.652508
D    0.751296
dtype: float64

By default: `axis = 0` or `axis = 'index'`

In [31]:
df.mean(1)

2018-01-01    0.382615
2018-01-02    0.268773
2018-01-03    0.340138
2018-01-04    1.317658
2018-01-05    0.220143
2018-01-06    0.076788
Freq: D, dtype: float64

`axis = 1` or `axis = 'columns'`

```
+------------+---------+--------+
|            |  A      |  B     |
+------------+---------+---------
|      0     | 0.626386| 1.52325|----axis=1----->
+------------+---------+--------+
             |         |
             | axis=0  |
             ↓         ↓
```

**Shift data:**

In [34]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index = dates).shift(2)

In [35]:
s

2018-01-01    NaN
2018-01-02    NaN
2018-01-03    1.0
2018-01-04    3.0
2018-01-05    5.0
2018-01-06    NaN
Freq: D, dtype: float64

**Subtract each column of df by a series:**

In [37]:
df.sub(s, axis = 'index')

                   A         B         C         D
2018-01-01       NaN       NaN       NaN       NaN
2018-01-02       NaN       NaN       NaN       NaN
2018-01-03  0.224524 -1.990449 -0.903547  0.030022
2018-01-04 -1.068905 -1.943661 -1.131457 -2.585343
2018-01-05 -2.519128 -6.855205 -6.065594 -3.679499
2018-01-06       NaN       NaN       NaN       NaN

## Applying functions

In [38]:
df.apply(np.cumsum)

                   A         B         C         D
2018-01-01 -0.403416 -0.272003  1.273209  0.932670
2018-01-02 -1.379047  0.893748  1.947826  1.143025
2018-01-03 -0.154522 -0.096701  2.044279  2.173047
2018-01-04  1.776572  0.959638  3.912822  2.587704
2018-01-05  4.257444 -0.895567  2.847227  3.908205
2018-01-06  2.642932 -0.641295  3.915051  4.507774

Return the cumulative sum. As mentioned before, by default: `axis = index`.

In [39]:
df.apply(lambda x: x.max() - x.min())

A    4.095384
B    3.020956
C    2.934137
D    1.110146
dtype: float64

##  Histogramming and Discretization

Create a series first:

In [40]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [41]:
s

0    1
1    4
2    6
3    1
4    5
5    5
6    4
7    3
8    2
9    6
dtype: int64

**value_counts:**

In [42]:
s.value_counts()

6    2
5    2
4    2
1    2
3    1
2    1
dtype: int64

## String Methods

Apply string methods as usual:

In [44]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [45]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## Merge

**Concatenating:**

In [46]:
df = pd.DataFrame(np.random.randn(10, 4))

In [47]:
df

          0         1         2         3
0  0.668551  1.302738 -0.642053  1.390026
1  0.991851 -1.054669 -0.193022  0.888978
2  1.050964 -1.063226  1.016499 -1.396485
3  0.826628 -0.616394 -0.447518  0.605147
4  0.589734  0.527775  0.272693 -1.715170
5 -0.196055  1.552040  0.293526  1.163211
6 -0.164080 -2.782687  1.509314 -0.120736
7 -1.039117 -1.344663  0.502927 -1.298748
8  0.760414 -2.140600  2.155047 -1.203678
9 -0.874182  1.438333  2.504494  0.305375

In [50]:
pieces = [df[:3], df[3:7], df[7:]]

In [51]:
pieces

[          0         1         2         3
 0  0.668551  1.302738 -0.642053  1.390026
 1  0.991851 -1.054669 -0.193022  0.888978
 2  1.050964 -1.063226  1.016499 -1.396485,
           0         1         2         3
 3  0.826628 -0.616394 -0.447518  0.605147
 4  0.589734  0.527775  0.272693 -1.715170
 5 -0.196055  1.552040  0.293526  1.163211
 6 -0.164080 -2.782687  1.509314 -0.120736,
           0         1         2         3
 7 -1.039117 -1.344663  0.502927 -1.298748
 8  0.760414 -2.140600  2.155047 -1.203678
 9 -0.874182  1.438333  2.504494  0.305375]

In [52]:
pd.concat(pieces)

          0         1         2         3
0  0.668551  1.302738 -0.642053  1.390026
1  0.991851 -1.054669 -0.193022  0.888978
2  1.050964 -1.063226  1.016499 -1.396485
3  0.826628 -0.616394 -0.447518  0.605147
4  0.589734  0.527775  0.272693 -1.715170
5 -0.196055  1.552040  0.293526  1.163211
6 -0.164080 -2.782687  1.509314 -0.120736
7 -1.039117 -1.344663  0.502927 -1.298748
8  0.760414 -2.140600  2.155047 -1.203678
9 -0.874182  1.438333  2.504494  0.305375

**Append:**

Append rows:

...to be continued